fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействия</name>
    <comment>Дата начала  абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействия</name>
    <comment>Дата окончания абонентского договора</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <comment>Стоимость часа работы специалиста</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);	
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда		
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Истина);
	Иначе
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Ложь);
	КонецЕсли;		
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда		
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Истина);
	Иначе
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Ложь);
		Объект.ВКМ_НачалоДействия = "";
		Объект.ВКМ_ОкончаниеДействия = "";
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		Объект.ВКМ_СуммаАбонентскойПлаты = 0;
	КонецЕсли;		
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
Процедура УстановитьВидимостьПолейДляАбонентскогоОбслуживания(ФлагВидимости)
	Если НЕ Элементы.Найти("ВКМ_ДатаНачала") = Неопределено Тогда
		Элементы.ВКМ_ДатаНачала.Видимость = ФлагВидимости;
	КонецЕСли;	
	
	Если НЕ Элементы.Найти("ВКМ_ДатаОкончания") = Неопределено Тогда
		Элементы.ВКМ_ДатаОкончания.Видимость = ФлагВидимости;
	КонецЕСли;
	
	Если НЕ Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ФлагВидимости;
	КонецЕСли;
	
	Если НЕ Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ФлагВидимости;
	КонецЕСли;
КонецПроцедуры	
//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
#КонецОбласти
